In [ ]:
import duckdb
import os
print("Fichier .db utilisé :", os.path.abspath('films_reco.db'))
# Connexion à la base de données
conn = duckdb.connect('films_reco.db')

# Lister les tables
tables = conn.execute("SHOW TABLES").fetchall()
print("Tables disponibles : ", tables)


# Si tu veux voir les données d'une table
table_name = "films"  # Remplace par ta table
# data = conn.execute(f"SELECT * FROM films").fetchall()
df = conn.execute("SELECT * FROM films").fetchdf()
print(conn.execute("SELECT count(*) FROM films").fetchall())

Fichier .db utilisé : c:\Users\lecle\code\informatique_avancee\projet\Projet\backend\app\utils\data\films_reco.db
Tables disponibles :  [('films',), ('ratings',)]
[(8125,)]

In [ ]:

conn.close()

In [ ]:
conn.execute("""
    DELETE FROM films
    WHERE release_date IS NULL;
""")

In [ ]:
conn.execute("SELECT count(rating) FROM ratings where rating = 0.5").fetchall()

[(23814,)]

In [6]:
conn.execute("SELECT count(*) FROM films").fetchall()

[(8125,)]

In [7]:
df = conn.execute("""
    SELECT genres
    FROM films
    WHERE STRFTIME('%Y', release_date) = ?
""", [str(2016)]).fetchdf()

df

                                       genres
0                    Action,Adventure,Fantasy
1                        Crime,Thriller,Drama
2     Fantasy,Action,Thriller,Science Fiction
3           Animation,Adventure,Family,Comedy
4                     Animation,Romance,Drama
..                                        ...
274  Adventure,Animation,Music,Fantasy,Comedy
275                       Music,Romance,Drama
276                            Drama,Thriller
277                              Comedy,Music
278                      Drama,Thriller,Crime

[279 rows x 1 columns]

In [8]:
conn.execute("""
    SELECT * FROM films WHERE id= 1461519
""").fetchone()

(1461519,
 'Untitled A Minecraft Movie Sequel',
 'Family,Comedy,Adventure,Fantasy',
 'The sequel to A Minecraft Movie. Plot TBA. Currently undergoing development and early production stages.',
 None,
 0.0,
 0)

In [11]:
count = conn.execute("SELECT COUNT(*) FROM ratings").fetchone()[0]
print("Nombre de lignes dans la table films :", count)

Nombre de lignes dans la table films : 1750845

In [10]:
count = conn.execute("SELECT COUNT(*) FROM films").fetchone()[0]
print("Nombre de lignes dans la table films :", count)

Nombre de lignes dans la table films : 8125

In [12]:
# Lire les 10 premières lignes de la table "ratings" dans un DataFrame
df = conn.execute("SELECT * FROM ratings LIMIT 10").fetchall()

for row in df:
    print(row)

(1, 110, 1.0, 1425941529)
(1, 147, 4.5, 1425942435)
(1, 858, 5.0, 1425941523)
(1, 1221, 5.0, 1425941546)
(1, 1246, 5.0, 1425941556)
(1, 1968, 4.0, 1425942148)
(1, 2762, 4.5, 1425941300)
(1, 2918, 5.0, 1425941593)
(1, 2959, 4.0, 1425941601)
(1, 4226, 4.0, 1425942228)

In [13]:
conn.close()

In [9]:
conn.execute("SELECT * FROM films WHERE id = 324544").fetchone()

(324544,
 'In the Lost Lands',
 'Fantasy,Adventure,Action',
 'A queen sends the powerful and feared sorceress Gray Alys to the ghostly wilderness of the Lost Lands in search of a magical power, where she and her guide, the drifter Boyce, must outwit and outfight both man and demon.',
 datetime.date(2025, 2, 27),
 6.295000076293945,
 285)